{
    "activities": [],
    "learningObjectives": [],
    "overview": [
        "Welcome to the Cloud Computing course, designed to give you a comprehensive view on the world of Cloud Computing and Big Data!<br><br>In this we cover a multitude of technologies that comprise the modern concept of cloud computing. Cloud computing is an information technology revolution that has just started to impact many enterprise computing systems in major ways, and it will change the face of computing in the years to come.<br><br>We start the first week by introducing some major concepts in cloud computing, the economics foundations of it and we introduce the concept of big data. We also cover the concept of software defined architectures, and how virtualization results in cloud infrastructure and how cloud service providers organize their offerings. On day two, we cover virtualization and containers with deeper focus, including lectures on Docker, JVM and Kubernates. We finish up day two by comparing the infrastructure as a service offering by the big three: Amazon, Google and Microsoft.<br><br>Day three moves to higher level of cloud offering, including platform as a service, mobile backend as a service and even serverless architectures. We also talk about some of the cloud middleware technologies that are fundamental to cloud based applications such as RPC and REST, JSON and load balancing. It also covers metal as a service (MaaS), where physical machines are provisioned in a cloud environment.<br><br>Day four introduces higher level cloud services with special focus on cloud storage services. We introduce Hive, HDFS and Ceph as pure Big Data Storage and file systems, and move on to cloud object storage systems, virtual hard drives and virtual archival storage options.<br><br>Day five introduces to hadoop which includes installation. As discussion on Dropbox cloud solution wraps up week 1.<br><br>In the second week,we will set up a single node and followed by solving problems with mapreduce."
    ],
    "title": "Cloud Computing",
    "units": [{
            "activities": [
                "Orientation on Cloud Computing",
                "Video on Introduction",
                "Video on Cloud Computing Introduction",
                "Video on Motivation Interview - University of Illinois at Urbana-Champaign - Coursera",
                "Video on Cloudonomics Part-1",
                "Video on Cloudonomics Part-2",
                "Video on Big Data",
                "Video on Cloud Introduction Summary",
                "Video on Software Defined Architecture",
                "Video on Cloud Services",
                "Video on  Infrastructure as a Service",
                "Assignment-1"

            ],
            "learningObjectives": [],
            "overview": [
                "This module begins with an orientation on Cloud Computing by the Mentor from 9:00 AM to 10:30 AM.<br><br> In this module, we will introduce the concept of cloud computing and the economical foundations that make cloud computing make sense. We then introduce some fundamental concepts including software defined architectures and cloud services. We end the module by introducing you to the low level cloud computing service offered, infrastructure as a service"
            ],
            "title": "Introduction to Cloud Computing"
        },
        {
            "activities": [
                "Video on Introduction",
                "Video on Virtualization",
                "Video on Virtualizing the Network and Storage",
                "Video on OS Based Virtualization",
                "Video on Xen",
                "Video on VServer 2.0",
                "Video on Solaris Zones",
                "Video on OpenVZ",
                "Video on  LXC Linux Containers",
                "Video on Docker",
                "Video on Kubernate",
                "Video on JVM",
                "Video on IaaS OpenStack",
                "Video on IaaS Providers Amazon",
                "Video on IaaS Providers Microsoft",
                "Video on IaaS Providers Google",
                "Video on Serverless Architecture",
                "Assignment-1"

            ],
            "learningObjectives": [],
            "overview": [
                "Welcome to the second module! Here, we cover virtualization and containers with deeper focus, including lectures on Docker, JVM and Kubernates. We finish up day two by comparing the infrastructure as a service offering by the big three: Amazon, Google and Microsoft."
            ],
            "title": "Foundations Containers, Virtual Machine, JVM"
        },
        {
            "activities": [
                "Video on Module 3 Introduction",
                "Video on MAAS Part 1",
                "Video on MAAS Part 2",
                "Video on Juju",
                "Video on PaaS Providers Google App Engine",
                "Video on PaaS Providers Salesforce",
                "Video on Web Services",
                "Video on RPC Semantics",
                "Video on RPC Implementation",
                "Video on HTTP SOAP REST",
                "Video on JSON",
                "Video on Load Balancer Introduction",
                "Video on Load Balancer Schemes",
                "Video on Protocol Buffers and Thrift",
                "Video on MBAAS",
                "Assignment-1"

            ],
            "learningObjectives": [],
            "overview": [
                "Welcome to the third module, where we introduce Metal as a Service (provision real hardware in the cloud), Platform as a Service (provide a platform to run user code on) and Web Middleware as the glue technology that empowers cloud computing.Welcome to the third module, where we introduce Metal as a Service (provision real hardware in the cloud), Platform as a Service (provide a platform to run user code on) and Web Middleware as the glue technology that empowers cloud computing."
            ],
            "title": "MAAS, PAAS, Web Services"
        },
        {
            "activities": [
                "Video on Module 4 Introduction",
                "Video on Ceph",
                "Video on HIVE",
                "Video on TEZ",
                "Video on SWIFT",
                "Video on Amazon S3 BLOB Storage",
                "Video on Amazon AWS EBS Storage",
                "Video on AWS Glacier",
                "Video on Amazon AWS Elastic File System",
                "Video on Dropbox API",
                "Assignment-1"

            ],
            "learningObjectives": [],
            "overview": [
                "Welcome to the fourth module of the cloud computing course! So far we have covered various methods of running certain computations on the cloud. Now it's time to focus on data storage in the clouds. In this module, we introduce big data and cloud file systems such as HDFS and Ceph, cloud object stores such has Openstack Swift or Amazon S3, virtualized block storage devices such as Amazon EBS and archival storage options like the Amazon Glacier. Finally, we conclude the module with introducing the DropBox cloud API that enables developers to quickly integrate cloud storage options in their applications."
            ],
            "title": "Storage Ceph, SWIFT, HDFS, NAAS, SAN, Zookeeper"
        },
         {
            "activities": [
                "Video on Hadoop",
                "Installation of Hadoop",
                "Assignment-1"

            ],
            "learningObjectives": [],
            "overview": [
                "<b>Big data</b> is a field that treats ways to analyze, systematically extract information from, or otherwise deal with data sets that are too large or complex to be dealt with by traditional data-processing application software. <br><br><b>Apache Hadoop</b> is a collection of open-source software utilities that facilitate using a network of many computers to solve problems involving massive amounts of data and computation. It provides a software framework for distributed storage and processing of big data using the MapReduce programming model."
            ],
            "title": "Basics of Big Data and Hadoop Introduction"
        },
        {
            "activities": [
                "HDFS Architecture",
                "Video on MapReduce Example",
                "Python MapReduce Framework",
                "MapReduce example in Java",
                "Problem-1",
                "Other Resources",
                "Assignment-1"

            ],
            "learningObjectives": [],
            "overview": [
                "In this assignment, you will be designing and implementing MapReduce algorithms for a variety of common data processing tasks. <br><br>The MapReduce programming model (and a corresponding system) was proposed in a 2004 paper from a team at Google as a simpler abstraction for processing very large datasets in parallel. The goal of this assignment is to give you experience “thinking in MapReduce.” We will be using small datasets that you can inspect directly to determine the correctness of your results and to internalize how MapReduce works. In the next assignment, you will have the opportunity to use a MapReduce-based system to process the very large datasets for which it was designed."
            ],
            "title": "Thinking in MapReduce"
        },
        {
            "activities": [
                "Assignment-1",
                "Assignment-2",
                "Assignment-3",
                "Assignment-4",
                "Assignment-5"

            ],
            "learningObjectives": [],
            "overview": [
                "In this assignment, you will be designing and implementing MapReduce algorithms for a variety of common data processing tasks. <br><br>The MapReduce programming model (and a corresponding system) was proposed in a 2004 paper from a team at Google as a simpler abstraction for processing very large datasets in parallel. The goal of this assignment is to give you experience “thinking in MapReduce.” We will be using small datasets that you can inspect directly to determine the correctness of your results and to internalize how MapReduce works. In the next assignment, you will have the opportunity to use a MapReduce-based system to process the very large datasets for which it was designed."
            ],
            "title": "Thinking in MapReduce-2"
        },
        {
            "activities": [],
            "learningObjectives": [],
            "overview": [],
            "title": "Module-8"
        },
        {
            "activities": [
                "Activity 1",
                "Activity 2"
            ],
            "learningObjectives": [],
            "overview": [],
            "title": "IaaS and SaaS"
        }
    ]
}