{
    "activities": [],
    "learningObjectives": [],
    "overview": [
        "Welcome to the Cloud Computing course, designed to give you a comprehensive view on the world of Cloud Computing and Big Data!<br><br>In this we cover a multitude of technologies that comprise the modern concept of cloud computing. Cloud computing is an information technology revolution that has just started to impact many enterprise computing systems in major ways, and it will change the face of computing in the years to come.<br><br>We start the first week by introducing some major concepts in cloud computing, the economics foundations of it and we introduce the concept of big data. We also cover the concept of software defined architectures, and how virtualization results in cloud infrastructure and how cloud service providers organize their offerings. On day two, we cover virtualization and containers with deeper focus, including lectures on Docker, JVM and Kubernates. We finish up day two by comparing the infrastructure as a service offering by the big three: Amazon, Google and Microsoft.<br><br>Day three moves to higher level of cloud offering, including platform as a service, mobile backend as a service and even serverless architectures. We also talk about some of the cloud middleware technologies that are fundamental to cloud based applications such as RPC and REST, JSON and load balancing. It also covers metal as a service (MaaS), where physical machines are provisioned in a cloud environment.<br><br>Day four introduces higher level cloud services with special focus on cloud storage services. We introduce Hive, HDFS and Ceph as pure Big Data Storage and file systems, and move on to cloud object storage systems, virtual hard drives and virtual archival storage options.<br><br>Day five introduces to hadoop which includes installation. As discussion on Dropbox cloud solution wraps up week 1.<br><br>In the second week,we will set up a single node and followed by solving problems with mapreduce."
    ],
    "title": "Cloud Computing",
    "units": [{
            "activities": [
                "Orientation on Cloud Computing",
                "Video on Introduction",
                "Video on Cloud Computing Introduction",
                "Video on Motivation Interview - University of Illinois at Urbana-Champaign - Coursera",
                "Video on Cloudonomics Part-1",
                "Video on Cloudonomics Part-2",
                "Video on Big Data",
                "Video on Cloud Introduction Summary",
                "Video on Software Defined Architecture",
                "Video on Cloud Services",
                "Video on  Infrastructure as a Service",
                "Assignment-1"

            ],
            "learningObjectives": [],
            "overview": [
                "This module begins with an orientation on Cloud Computing by the Mentor from 9:00 AM to 10:30 AM.<br><br> In this module, we will introduce the concept of cloud computing and the economical foundations that make cloud computing make sense. We then introduce some fundamental concepts including software defined architectures and cloud services. We end the module by introducing you to the low level cloud computing service offered, infrastructure as a service"
            ],
            "title": "Introduction to Cloud Computing"
        },
        {
            "activities": [
                "Video on Introduction",
                "Video on Virtualization",
                "Video on Virtualizing the Network and Storage",
                "Video on OS Based Virtualization",
                "Video on Xen",
                "Video on VServer 2.0",
                "Video on Solaris Zones",
                "Video on OpenVZ",
                "Video on  LXC Linux Containers",
                "Video on Docker",
                "Video on Kubernate",
                "Video on JVM",
                "Video on IaaS OpenStack",
                "Video on IaaS Providers Amazon",
                "Video on IaaS Providers Microsoft",
                "Video on IaaS Providers Google",
                "Video on Serverless Architecture",
                "Assignment-1"

            ],
            "learningObjectives": [],
            "overview": [
                "Welcome to the second module! Here, we cover virtualization and containers with deeper focus, including lectures on Docker, JVM and Kubernates. We finish up day two by comparing the infrastructure as a service offering by the big three: Amazon, Google and Microsoft."
            ],
            "title": "Foundations Containers, Virtual Machine, JVM"
        },
        {
            "activities": [
                "Video on Module 3 Introduction",
                "Video on MAAS Part 1",
                "Video on MAAS Part 2",
                "Video on Juju",
                "Video on PaaS Providers Google App Engine",
                "Video on PaaS Providers Salesforce",
                "Video on Web Services",
                "Video on RPC Semantics",
                "Video on RPC Implementation",
                "Video on HTTP SOAP REST",
                "Video on JSON",
                "Video on Load Balancer Introduction",
                "Video on Load Balancer Schemes",
                "Video on Protocol Buffers and Thrift",
                "Video on MBAAS",
                "Assignment-1"

            ],
            "learningObjectives": [],
            "overview": [
                "Welcome to the third module, where we introduce Metal as a Service (provision real hardware in the cloud), Platform as a Service (provide a platform to run user code on) and Web Middleware as the glue technology that empowers cloud computing.Welcome to the third module, where we introduce Metal as a Service (provision real hardware in the cloud), Platform as a Service (provide a platform to run user code on) and Web Middleware as the glue technology that empowers cloud computing."
            ],
            "title": "MAAS, PAAS, Web Services"
        }
    ]
}